Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: These type names must be enclosed in quotes when used as literal strings.
ja: これらの型名をリテラル文字列として使用する場合は、引用符で囲む必要があります。

source: These values are always greater than or equal to SM_CXICON and SM_CYICON.
ja: これらの値は常にSM_CXICONおよびSM_CYICON以上である。

source: These values are always greater than or equal to SM_CXMINIMIZED and SM_CYMINIMIZED.
ja: これらの値は常にSM_CXMINIMIZEDおよびSM_CYMINIMIZED以上である。

source: These values are in pixels.
ja: これらの値はピクセル単位である。

source: These variables cannot be dynamic.
ja: これらの変数は動的にはありえない。

source: These variables have names beginning with A_Loop, such as A_LoopFileName and A_LoopReadLine.
ja: これらの変数は、A_LoopFileNameやA_LoopReadLineなど、A_Loopで始まる名前を持っています。

source: These words are reserved for future use or other specific purposes, and are not permitted as variable or function names even when unambiguous.
ja: これらの単語は、将来の使用やその他の特定の目的のために予約されており、曖昧でない場合でも、変数名や関数名として許可されていません。

source: These words are reserved for future use or other specific purposes.
ja: これらの単語は、将来の使用やその他の特定の目的のために予約されています。

source: They affect only the very next key.
ja: 次のキーにしか影響しません。

source: They also affect the use of ahk_group in any other function's WinTitle.
ja: また、他の関数のWinTitleでahk_groupを使用する場合にも影響します。

source: They are not affected by #HotIf.
ja: 彼らは#HotIfの影響を受けません。

source: They are affected by the Suspend function.
ja: それらはSuspend機能の影響を受けます。

source: They are also skipped by the Alt+Esc and Alt+Shift+Esc system hotkeys.
ja: また、Alt+EscとAlt+Shift+Escのシステムホットキーでもスキップされます。

source: They are automatically converted to their filenames (with full path) whenever A_Clipboard is referenced in the script.
ja: スクリプト内でA_Clipboardが参照されるたびに、それらは自動的にファイル名（フルパス付き）に変換されます。

source: They are created with MenuBar().
ja: MenuBar()で作成します。

source: They are declared and behave like normal assignments, but the this. prefix is omitted (only directly within the class body):
ja: これらは宣言され、通常の代入と同じように振る舞いますが、this.接頭辞は省略されます（クラス本体内でのみ）：

source: They are declared like instance variables, but using the static keyword:
ja: インスタンス変数と同じように、staticキーワードを使って宣言する：

source: They are evaluated when the class is referenced for the first time (rather than being evaluated before the auto-execute section begins, strictly in the order of definition).
ja: これらは、クラスが初めて参照されたときに評価されます（自動実行部が始まる前に評価されるのではなく、厳密には定義順に評価されます）。

source: They are most often used with functions and control flow statements such as If and Loop.
ja: 関数や、Ifや Loopのような制御フロー文と一緒に使われることが多い。

source: They are normally available in the file's right-click menu in Explorer, but their actual names don't always match the text displayed in the menu.
ja: これらは通常、エクスプローラーのファイルの右クリックメニューで利用できますが、実際の名前はメニューに表示されるテキストと必ずしも一致しません。

source: They are typically used to add explanation or disable parts of the code.
ja: 一般的には、説明を加えたり、コードの一部を無効にしたりするために使用されます。

source: They are useful when searching for spaces and tabs alone or at the beginning or end of Needle.
ja: スペースやタブを単独で、あるいはニードルの先頭や末尾で検索する場合に便利である。

source: They can be called indirectly.
ja: 間接的に呼ばれることもある。

source: They can be used in combination, but otherwise affect only the next key.
ja: これらは組み合わせて使うことができますが、それ以外は次のキーにしか影響しません。

source: They can be used to make a script more readable as in these examples:
ja: これらの例は、スクリプトをより読みやすくするために使われます。

source: They can be used to make a script more readable.
ja: これらは、スクリプトをより読みやすくするために使用することができます。

source: They can be used to store text, numbers, data from functions or even mathematical equations.
ja: テキスト、数値、関数からのデータ、あるいは数式を保存するのに使うことができる。

source: They group a section of code together so that AutoHotkey knows it's one big family and that it needs to stay together.
ja: AutoHotkeyが1つの大きなファミリーであることを認識し、一緒にいる必要があるように、コードのセクションをグループ化します。

source: They obey #MaxThreads and #MaxThreadsPerHotkey (but not #MaxThreadsBuffer).
ja: これらは#MaxThreadsと #MaxThreadsPerHotkeyに従います（#MaxThreadsBufferは従いません）。

source: They sometimes return strings in v1 due to certain optimizations which have been superseded in v2.
ja: v1では特定の最適化により文字列を返すことがありましたが、v2ではそのようなことはありません。

source: They specify the new item's position relative to its siblings (a sibling is any other item on the same level).
ja: 新しいアイテムの位置は、その兄弟アイテム（兄弟アイテムとは、同じレベルにある他のアイテムのことです）との相対的な位置関係で指定されます。

source: They take one, two or three values as input and return a value as the result.
ja: 1つ、2つ、3つの値を入力として受け取り、結果として値を返します。

source: They were redundant; basically just a limited form of function, without local variables or a return value, and being in their own separate namespace.
ja: ローカル変数も戻り値もなく、独立した名前空間にある、基本的に限定的な関数の一種だったのです。

source: Thickness of the frame around the perimeter of a window that has a caption but is not sizable, in pixels.
ja: キャプションを持つが大きくないウィンドウの外周の枠の太さ（ピクセル単位）。

source: Thickness of the sizing border around the perimeter of a window that can be resized, in pixels.
ja: リサイズ可能なウィンドウの外周のサイズ調整枠の太さ（ピクセル単位）。

source: Things like GameGuard, Hackshield, PunkBuster and several others.
ja: GameGuard、Hackshield、PunkBusterなどだ。

source: Think of this as "the preceding item is optional".
ja: これは「前の項目はオプションである」と考えてほしい。

source: This "reset upon mouse click" behavior is the default because each click typically moves the text insertion point (caret) or sets keyboard focus to a new control/field.
ja: クリックするたびにテキスト挿入点（キャレット）が移動したり、キーボードフォーカスが新しいコントロール/フィールドに設定されるのが普通なので、この「マウスクリックでリセット」動作がデフォルトになっています。

source: This 50ms delay can be avoided by enabling this directive for any hotkey that needs the best possible response time while it is being auto-repeated.
ja: この50msの遅延は、自動リピート中に最良の応答時間を必要とするホットキーに対してこのディレクティブを有効にすることで回避することができます。

source: This 50 ms delay can be avoided by enabling this directive for any hotkey that needs the best possible response time while it is being auto-repeated.
ja: この50 msの遅延は、自動リピート中に最良の応答時間を必要とするホットキーに対してこのディレクティブを有効にすることで回避することができます。

source: This Array method removes the last element from an array and returns its value.
ja: このArrayメソッドは、配列から最後の要素を取り除き、その値を返します。

source: This example script makes 000 into an equals key.
ja: このスクリプトの例では、000をイコールキーにします。

source: This test script can be used to analyze your joystick(s).
ja: このテストスクリプトを使用して、ジョイスティックを解析することができます。

source: This must not contain double quotes (except for an optional pair of double quotes surrounding the parameter), wildcards or escape sequences other than semicolon (`;).
ja: 二重引用符（パラメータを囲む二重引用符の組を除く）、ワイルドカード、セミコロン（`;）以外のエスケープシーケンスを含んではならない。

source: This must not contain double quotes, wildcards or escape sequences other than semicolon (`;).
ja: 二重引用符、ワイルドカード、セミコロン（`;）以外のエスケープシーケンスを含んではならない。

source: This AltTab hotkey must have exactly one modifier/prefix
ja: このAltTabホットキーは、正確に1つの修飾語/接頭辞を持つ必要があります。

source: This AltTab hotkey must have exactly one modifier/prefix.
ja: このAltTabホットキーは、正確に1つの修飾語/接頭辞を持つ必要があります。

source: This AltTab hotkey must specify which key (L or R).
ja: このAltTabホットキーは、どのキー（LまたはR）を指定する必要があります。

source: This General Public License applies to most of the Free Software Foundation's software and to any other program whose authors commit to using it.
ja: この一般公衆利用許諾契約書は、フリーソフトウェアファウンデーションのソフトウェアの大部分と、その作者がこの利用許諾契約書を使うことを約束したその他のプログラムに適用されます。

source: This ID can be used to identify the window or control even if its title changes.
ja: このIDは、ウィンドウやコントロールのタイトルが変わっても識別できる。

source: This ID cannot be used with the Menu object, but can be used with various Win32 functions.
ja: このIDはMenuオブジェクトでは使用できませんが、Win32の各種機能で使用することができます。

source: This above was for PostMessage.
ja: これはPostMessage用である。

source: This address is typically passed to an external function via DllCall or placed in a struct using NumPut, but can also be called directly by DllCall.
ja: このアドレスは通常、DllCallで外部関数に渡されるか、NumPutで構造体に入れられるが、DllCallで直接呼び出すことも可能です。

source: This address is valid until the object is freed.
ja: このアドレスは、オブジェクトが解放されるまで有効です。

source: This address uniquely identifies the object, but only until the object is freed.
ja: このアドレスは、オブジェクトを一意に識別しますが、オブジェクトが解放されるまでの間だけです。

source: This adds up to a noticeable delay when sending a large amount of text.
ja: そのため、大量のテキストを送信する際には、顕著な遅延が発生します。

source: This affects built-in functions such as WinExist and WinActivate.
ja: これは、WinExistや WinActivateなどのビルトイン関数に影響します。

source: This affects windowing functions such as WinExist and WinActivate.
ja: これはWinExist関数やWinActivate関数のようなウィンドウ関連の関数に影響します。

source: This allows a compiled script .exe to execute external script files or embedded scripts other than the main one.
ja: これにより、コンパイルされたスクリプト.exeは、メインスクリプト以外の外部スクリプトファイルや埋め込みスクリプトを実行できるようになる。

source: This allows a continuation section to be used for a multi-line expression following return, function call statements, etc.
ja: これにより、returnや関数呼び出し文などに続く複数行の表現に、継続セクションを使用することができます。

source: This allows a hotkey to perform a different operation depending on how many times you press it.
ja: これにより、ホットキーは押す回数によって異なる操作を行うことができます。

source: This allows a long-lined directive to be formatted so that it is easy to read in the source code.
ja: これにより、長い行のディレクティブをソースコード上で読みやすいように書式設定することができます。

source: This allows classes to modify or prevent the construction of new instances.
ja: これにより、クラスは新しいインスタンスを修正したり、構築できないようにすることができます。

source: This allows command prompt and other console windows to properly detect uppercase letters, control characters, etc.
ja: これにより、コマンドプロンプトなどのコンソールウィンドウで、大文字や制御文字などを適切に検出することができます。

source: This allows constructs such as DllCall(..., "Ptr*", unk := IUnknown()), which reduces repetition compared to DllCall(..., "Ptr*", punk), unk := IUnknown(punk), and can be used to ensure any output from the function is properly freed (even if an exception is thrown due to the HRESULT return type, although typically the function would not output a non-null pointer in that case).
ja: これにより、DllCall(..., "Ptr*", unk := IUnknown()) のような構成が可能になり、DllCall(..., "Ptr*", punk), unk := IUnknown(punk)と比較して繰り返しが少なく、関数からの出力が適切に解放されるように使用できます（HRESULT戻り値型のために例外がスローされても、通常その場合関数は非 NULL ポインタを出力しないでしょう）。

source: This allows constructs such as DllCall(..., "Ptr*", unk := IUnknown.new()), which reduces repetition compared to DllCall(..., "Ptr*", punk), unk := IUnknown.new(punk), and can be used to ensure any output from the function is properly freed (even if an exception is thrown due to the HRESULT return type, although typically the function would not output a non-null pointer in that case).
ja: これにより、DllCall(..., "Ptr*", unk := IUnknown.new()) のような構成が可能になり、DllCall(..., "Ptr*", punk), unk := IUnknown.new(punk)と比較して繰り返しが少なく、関数からの出力が適切に解放されるように使用できます (HRESULT戻り値型のために例外がスローされても、通常その場合関数は非 NULL ポインタを出力しないでしょう).

source: This allows errors to be identified more easily than if a null value was implicitly allowed to propagate through the code.
ja: これにより、NULL値を暗黙のうちにコード内に伝播させる場合よりも、より簡単にエラーを特定することができます。

source: This allows fancy editors such as SciTE to capture warnings without disrupting the script - the user can later jump to each offending line via the editor's output pane.
ja: これにより、SciTEのような高級エディタがスクリプトを中断することなく警告を捕らえることができ、ユーザーは後でエディタの出力ペインから問題のある行にジャンプすることができます。

source: This allows fancy editors such as TextPad, SciTE, Crimson, and EditPlus to jump to the offending line when a syntax error occurs.
ja: これにより、TextPad、SciTE、Crimson、EditPlusなどの高級エディタは、シンタックスエラーが発生したときに問題のある行にジャンプすることができます。

source: This allows file types such as .ahk, .vbs or .lnk to accept parameters while still allowing "known" executables such as wordpad.exe to be launched without an absolute path as in previous versions.
ja: これにより、.ahk、.vbs、.lnkなどのファイルタイプでパラメータを受け付けることができるようになり、かつ、wordpad.exeなどの「既知の」実行ファイルを、以前のバージョンのように絶対パスなしで起動できるようになりました。

source: This allows function objects (such as closures) to be used directly.
ja: これにより、関数オブジェクト（クロージャなど）を直接使用することができます。

source: This allows functions for windows and controls -- such as WinGetStyle, WinSetTransparent, and ControlGetFocus -- to omit WinTitle and WinText when operating upon the GUI window itself (even if it is hidden).
ja: これにより、WinGetStyle、WinSetTransparent、ControlGetFocusなどのウィンドウやコントロールに関する関数が、GUIウィンドウ自体を操作する際に（たとえそれが隠されていても）WinTitleやWinTextを省略することができます。

source: This allows functions to read global variables or call global or built-in functions without declaring them inside the function, while protecting the script from unintended side-effects when the name of a local variable being assigned coincides with a global variable.
ja: これにより、関数は関数内で宣言することなく、グローバル変数の読み込みや、グローバル関数や組み込み関数の呼び出しを行うことができます。また、代入されるローカル変数の名前がグローバル変数と一致する場合に、意図しない副作用からスクリプトを保護します。

source: This allows hotkeys which send {Blind}{LWin up} to activate the Start menu (which was already possible if using a remapped key such as AppsKey::RWin).
ja: これにより、{Blind}{LWin up}を送信するホットキーでスタートメニューを起動できるようになりました（AppsKey::RWinなどのリマップキーを使用すれば、すでに可能でした）。

source: This allows keys to be excluded by name after applying an option to all keys.
ja: これにより、すべてのキーにオプションを適用した後に、キー名を指定して除外することができます。

source: This allows more flexibility, such as storing references elsewhere, accepting them with a variadic function and passing them on with a variadic call.
ja: これにより、参照を別の場所に保存し、可変長引数関数で受け入れ、可変長引数コールで渡すなど、より柔軟な対応が可能になります。

source: This allows multi-line expressions to be written using a continuation section with default options (i.e. omitting Join).
ja: これにより、複数行の式を、デフォルトのオプション（Joinの省略など）で継続セクションを使って書くことができます。

source: This allows some things that didn't work previously, but in some very rare cases, may also affect scripts which were already working in AutoHotkey Basic.
ja: これにより、以前は動作しなかったものが動作するようになりますが、ごく稀に、AutoHotkey Basicで既に動作していたスクリプトにも影響を与える場合があります。

source: This allows subroutines launched by new threads (such as for hotkeys, menus, timers and such) to change settings without affecting other threads.
ja: これにより、新しいスレッドで起動したサブルーチン（ホットキー、メニュー、タイマーなど）が、他のスレッドに影響を与えずに設定を変更することができます。

source: This allows suspension to be turned off via a hotkey, which would otherwise be impossible since the hotkey would be suspended.
ja: これにより、ホットキーでサスペンドをオフにすることができます。

source: This allows the ComObject itself to be passed to any DllCall or ComCall parameter which has the "Ptr" type, but can also be used explicitly.
ja: これにより、ComObject自体を"Ptr"型を持つDllCallやComCallのパラメータに渡すことができ、また、明示的に使用することもできる。

source: This allows the Swap function to alter the caller's variables by moving Left's contents into Right and vice versa.
ja: これにより、Swap関数は、左の内容を右に移動したり、逆に右の内容を右に移動したりして、呼び出し側の変数を変更することができます。

source: This allows the class to fully override construction behaviour (e.g. to implement a class factory or singleton, or to construct a native Array or Map instead of an Object), although initialization should still typically be performed in __New.
ja: これにより、クラスの構築動作を完全にオーバーライドすることができます（例えば、クラスファクトリやシングルトンを実装したり、Objectの代わりにネイティブなArrayやMapを構築したりすることができます）。ただし、初期化は通常__Newで行う必要があります。

source: This allows the contents of the window behind it to show through.
ja: これにより、背後のウィンドウの内容が透けて見えるようになります。

source: This allows the name of the property or method to be determined while the script is running.
ja: これにより、スクリプトの実行中にプロパティやメソッドの名前を決定することができます。

source: This allows the options mentioned above to be varied during the course of building a single line.
ja: これにより、1つのラインを構築する過程で、上記のオプションを変化させることができる。

source: This allows the script to easily activate standard keyboard shortcuts.
ja: これにより、スクリプトは標準的なキーボードショートカットを簡単に起動することができます。

source: This allows the script to easily continue or break out of any number of nested loops without using Goto.
ja: これにより、Gotoを使用しなくても、スクリプトを簡単に続行したり、任意の数の入れ子ループから抜け出したりすることができます。

source: This allows the script to easily continue or break out of any number of nested loops.
ja: これによってスクリプトは、いくつでもネストされたループを簡単に続行したり抜け出したりできるようになる。

source: This allows the script to properly resume operation when you un-pause it.
ja: これにより、一時停止を解除したときにスクリプトが適切に動作を再開する。

source: This allows the script to refer to a variable or property whose name is determined by evaluating Expr, which is typically another variable.
ja: これによってスクリプトは、Exprを評価することで名前が決まる変数やプロパティ（通常は別の変数）を参照できるようになる。

source: This allows them to be passed to DllCall or ComCall with the Ptr arg type.
ja: これにより、DllCallやComCallにPtrのarg型で渡すことができるようになります。

source: This allows you to clean up your desktop much more quickly than doing it manually.
ja: これにより、手動で行うよりもはるかに早くデスクトップをクリーンアップすることができます。

source: This also allows linefeed (`n) to start new lines of text.
ja: また、改行コード（`n）で改行することもできます。

source: This also causes minutes and seconds to be shown.
ja: これにより、分と秒が表示されるようにもなります。

source: This also causes the SendInput function itself to revert to Play mode when SendInput is unavailable.
ja: これにより、SendInputが使用できない場合は、SendInput機能自体がPlayモードに戻るようにもなっています。

source: This also causes the short date to be in effect.
ja: これによって、ショートデイトも有効になります。

source: This also increases the height of each row in the ListView to fit the large icon.
ja: また、ListViewの各行の高さを大きくして、大きなアイコンに合わせます。

source: This also prevents the translation of any explicitly specified escape sequences such as `r and `t.
ja: また、`rや`tのような明示的に指定されたエスケープシーケンスも変換されなくなる。

source: This also puts the following into effect:
ja: これによって、以下のことも有効になる：

source: This also works on hidden controls even when DetectHiddenWindows is Off.
ja: また、DetectHiddenWindowsがOffの場合でも、非表示のコントロールに対して機能します。

source: This always hides the maximize and minimize buttons, regardless of whether the WS_MAXIMIZEBOX and WS_MINIMIZEBOX styles are present.
ja: WS_MAXIMIZEBOXとWS_MINIMIZEBOXのスタイルが存在するかどうかに関わらず、常に最大化、最小化ボタンを非表示にします。

source: This and other related variables are valid only inside a file loop.
ja: この変数とその他の関連変数は、ファイル・ループ内でのみ有効である。

source: This and other related variables are valid only inside a registry loop.
ja: この変数とその他の関連変数は、レジストリのループ内でのみ有効である。

source: This and the other two below can also be used inside a class; for example, [\d.-] means "any single digit, period, or minus sign".
ja: これと以下の2つはクラス内部でも使える。例えば、[\d.-]は「一桁の数字、ピリオド、マイナス記号」を意味する。

source: This applies to instances of YourClassName, such as the object returned by YourClassName().
ja: これは、YourClassName()が返すオブジェクトなど、YourClassNameのインスタンスに適用されます。

source: This applies to all message boxes, not just those produced by AutoHotkey.
ja: これは、AutoHotkeyで作成されたメッセージボックスだけでなく、すべてのメッセージボックスに適用されます。

source: This assigns the return value of WinWait to the variable "notepad_id".
ja: これは、WinWaitの戻り値を変数「notepad_id」に代入しています。

source: This assumes AutoHotkey has already been installed.
ja: これは、AutoHotkeyがすでにインストールされていることを前提としています。

source: This assumes there is such a driver for your particular keyboard or mouse and that you can live without the features provided by its custom driver and software.
ja: これは、お使いのキーボードやマウスにそのようなドライバがあり、そのカスタムドライバやソフトウェアが提供する機能なしでいられることを前提としています。

source: This assumes there is such a driver for your particular mouse and that you can live without the features provided by your mouse's custom software.
ja: これは、あなたの特定のマウスにそのようなドライバがあり、あなたのマウスのカスタムソフトウェアによって提供される機能なしで生きることができることを前提としています。

source: This attribute need not be specified for Integer and Float columns because they are right-aligned by default.
ja: IntegerおよびFloatカラムはデフォルトで右寄せになっているため、この属性を指定する必要はありません。

source: This avoids holding the mouse button down during the click, which in turn reduces interference from the user's physical movement of the mouse.
ja: これにより、クリック中にマウスボタンを押し続けることがなくなり、ユーザーのマウスの物理的な動きによる干渉を軽減することができます。

source: This avoids some inconsistencies and common points of confusion.
ja: これにより、いくつかの矛盾や共通の混乱点を回避することができます。

source: This avoids the need to escape quote marks in multi-line strings (if the starting and ending quotes are outside the continuation section) while still allowing multi-line expressions to contain quoted strings.
ja: これにより、複数行の文字列で引用符をエスケープする必要がなくなり（開始と終了の引用符が継続部分の外にある場合）、かつ複数行の式に引用符付きの文字列を含めることができます。

source: This avoids the possibility of an infinite loop where hotstrings trigger each other over and over.
ja: これにより、ホットストリングが何度もトリガーする無限ループの可能性を回避することができます。

source: This basically means that all of the script's environment variables are inherited by any program that you launch with Run.
ja: これは基本的に、スクリプトの環境変数がすべて、Runで起動したプログラムに継承されることを意味します。

source: This becomes the return value of an implicit function which has one parameter (ThisHotkey).
ja: これは、1つのパラメータ（ThisHotkey）を持つ暗黙の関数の戻り値になります。

source: This behavior allows GroupClose to be assigned to a hotkey as a companion to GroupName's GroupActivate or GroupDeactivate hotkey.
ja: この動作により、GroupNameのGroupActivateまたはGroupDeactivateのホットキーに付随するものとして、GroupCloseをホットキーに割り当てることができます。

source: This behavior applies to all sending modes except SendPlay (which doesn't need it), blind mode and text mode.
ja: この動作は、SendPlay（不要）、ブラインドモード、テキストモード以外のすべての送信モードに適用されます。

source: This behavior is similar to ~CapsLock up::.
ja: この動作は、~CapsLock up::と似ています。

source: This behavior is useful to make a GUI window have a similar font on multiple systems, even if some of those systems lack the preferred font.
ja: この動作は、GUIウィンドウが複数のシステムで同じようなフォントを持つようにするのに便利で、それらのシステムの一部が優先フォントを持たない場合であっても、この動作は有効です。

source: This behaviour can be avoided by applying the tilde prefix to either hotkey.
ja: この動作は、いずれかのホットキーにチルダ接頭辞を付けることで回避できます。

source: This behaviour can be controlled with #InputLevel and SendLevel.
ja: この動作は、#InputLevelと SendLevelで制御することができます。

source: This built-in optimization is more effective than the example shown above.
ja: このビルトイン最適化は、上に示した例よりも効果的です。

source: This can also be a comma-delimited list of classes.
ja: これは、カンマで区切られたクラスのリストであることも可能です。

source: This can also be a device path in the form "\\?\Volume{...}", which can be discovered by running mountvol at the command line.
ja: これは、コマンドラインでmountvolを実行することで発見できる"\\?\Volume{...}"ような形のデバイスパスであることもあります。

source: This can also be a device path in the form \\?\Volume{...}, which can be discovered by running mountvol at the command line.
ja: これは、コマンドラインでmountvolを実行することで発見できる\\?\Volume{...}ような形のデバイスパスであることもあります。

source: This can also be a dynamic variable such as Array%i% or a function's ByRef parameter.
ja: これは、Array%i%などの動的変数や関数の ByRef パラメータにすることもできます。

source: This can be a function object, a hotkey name without trailing colons, or one of the special values listed below.
ja: これは、関数オブジェクト、末尾のコロンがないホットキー名、または以下に示す特別な値のいずれかである可能性があります。

source: This can be achieved by calling VarSetStrCapacity(&MyVar, 123), where 123 is the number of 16-bit units (loosely referred to as characters) that MyVar must be able to hold.
ja: ここで、123はMyVarが保持しなければならない16ビット単位（緩やかに文字と呼ばれる）の数である、VarSetStrCapacity(&MyVar, 123)を呼び出すことで実現できる。

source: This can be achieved by calling VarSetStrCapacity(MyVar, 123), where 123 is the number of 16-bit units (loosely referred to as characters) that MyVar must be able to hold.
ja: ここで、123はMyVarが保持しなければならない16ビット単位（緩やかに文字と呼ばれる）の数である、VarSetStrCapacity(MyVar, 123)を呼び出すことで実現できる。

source: This can be alleviated somewhat by using the redraw tip described in the Add method.
ja: これは、Addメソッドで説明した再描画のチップを使うことで、いくらか軽減できる。

source: This can be avoided by explicitly sending modifier up and down events as in this example:
ja: これは、この例のように、モディファイアのアップとダウンのイベントを明示的に送信することで回避することができます：

source: This can be avoided by setting the context to -3 before creating the GUI, but -4 before creating any tooltips, menus or dialogs.
ja: これは、GUIを作成する前にコンテキストを-3に設定し、ツールチップ、メニュー、ダイアログを作成する前に-4に設定することで回避できます。

source: This can be avoided by waiting for the keys to be released prior to turning BlockInput on, as in this example:
ja: この例では、BlockInputをオンにする前にキーが解放されるのを待つことで、これを回避することができます：

source: This can be changed via the "i" option.
ja: これは「i」オプションで変更できる。

source: This can be done as follows (the two lines below are equivalent):
ja: これは以下のようにできる（以下の2行は同等）：

source: This can be done by "wrapping" it with ComValue.
ja: これは、ComValueで「ラップ」することで可能になる。

source: This can be done by applying this registry patch or by running UX\reset-assoc.ahk from the AutoHotkey installation directory.
ja: このレジストリパッチを適用するか、AutoHotkeyのインストールディレクトリからUX\reset-assoc.ahkを実行すれば上記のレジストリキーを削除できます。
